0/alpha.water.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    leftWall
    {
        type            zeroGradient;
    }

    rightWall
    {
        type            zeroGradient;
    }

    lowerWall
    {
        type            zeroGradient;
    }

    upperWall
    {
	type		zeroGradient;
    }

    atmosphere
    {
        type            inletOutlet;
	inletValue	uniform 0;
	value		uniform 0;
    }

    inlet
    {
	type		fixedValue;
	value		uniform 1;
    }

    outlet
    {
	type		inletOutlet;
	inletValue	uniform 0;
	value		uniform 0;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
