system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
	(0 0 0)		//0
	(0 0.2 0)	//1
	(0 0.25 0)	//2
	(0 0.4 0)	//3
	(-0.2 0.4 0)	//4
	(-0.2 0.5 0)	//5
	(0 0.5 0)	//6
	(0 0.7 0)	//7
	(0.4 0.7 0)	//8
	(0.4 0.5 0)	//9
	(0.4 0.4 0)	//10
	(0.4 0.25 0)	//11
	(0.7 0.25 0)	//12
	(0.7 0.2 0)	//13
	(0.4 0.2 0)	//14
	(0.4 0 0)	//15
	(0 0 0.1)       //16
        (0 0.2 0.1)     //17
        (0 0.25 0.1)    //18
        (0 0.4 0.1)     //19
        (-0.2 0.4 0.1)  //20
        (-0.2 0.5 0.1)  //21
        (0 0.5 0.1)     //22
        (0 0.7 0.1)     //23
        (0.4 0.7 0.1)   //24
        (0.4 0.5 0.1)   //25
        (0.4 0.4 0.1)   //26
        (0.4 0.25 0.1)  //27
        (0.7 0.25 0.1)  //28
        (0.7 0.2 0.1)   //29
        (0.4 0.2 0.1)   //30
        (0.4 0 0.1)     //31
);

blocks
(
    /*hex (0 15 14 1 16 31 30 17) (120 60 1) simpleGrading (1 1 1)
    hex (1 14 11 2 17 30 27 18) (120 15 1) simpleGrading (1 1 1)
    hex (2 11 10 3 18 27 26 19) (120 45 1) simpleGrading (1 1 1)
    hex (3 10 9 6 19 26 25 22) (120 30 1) simpleGrading (1 1 1)
    hex (6 9 8 7 22 25 24 23) (120 30 1) simpleGrading (1 1 1)
    hex (4 3 6 5 20 19 22 21) (60 30 1) simpleGrading (1 1 1)
    hex (14 13 12 11 30 29 28 27) (90 15 1) simpleGrading (1 1 1)*/

    hex (0 15 14 1 16 31 30 17) (40 20 1) simpleGrading (1 1 1)
    hex (1 14 11 2 17 30 27 18) (40 5 1) simpleGrading (1 1 1)
    hex (2 11 10 3 18 27 26 19) (40 15 1) simpleGrading (1 1 1)
    hex (3 10 9 6 19 26 25 22) (40 10 1) simpleGrading (1 1 1)
    hex (6 9 8 7 22 25 24 23) (40 20 1) simpleGrading (1 1 1)
    hex (4 3 6 5 20 19 22 21) (20 10 1) simpleGrading (1 1 1)
    hex (14 13 12 11 30 29 28 27) (30 5 1) simpleGrading (1 1 1)

);

edges
(
);

boundary
(

    leftWall
    {
        type wall;
        faces
        (
            (0 1 17 16)
            (1 2 18 17)
	    (2 3 19 18)
	    (6 7 23 22)
        );
    }

    rightWall
    {
        type wall;
        faces
        (
            (9 25 24 8)
            (10 26 25 9)
	    (11 27 26 10)
	    (15 31 30 14)
        );
    }

    lowerWall
    {
        type wall;
        faces
        (
            (0 16 15 31)
	    (3 4 20 19)
	    (13 14 30 29)
        );
    }

    upperWall
    {
	type wall;
	faces
	(
	    (5 6 22 21)
	    (11 12 28 27)
	);
    }

    atmosphere
    {
        type patch;
        faces
        (
            (7 8 24 23)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (4 5 21 20)
        );
    }

    outlet
    {
	type patch;
	faces
	(
	    (13 29 28 12)
	);
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
